{
    "seasons": [
      {
        "number": 1,
        "image": "img/seasons/season01.jpg",
        "description_text": "The first season of the sitcom 'Friends' introduces us to the lives of six close-knit friends living in New York City: Monica, Ross, Chandler, Joey, Rachel, and Phoebe. Rachel Green, a runaway bride, seeks refuge in the group and becomes Monica's new roommate. Ross Geller, Monica's older brother, is coping with the recent divorce from his wife, Carol, who has come out as a lesbian. Chandler Bing, known for his sarcastic humor, works in an office job and has commitment issues. Joey Tribbiani, an aspiring actor, is known for his womanizing ways. Phoebe Buffay is a quirky, free-spirited musician. Throughout the season, the friends navigate their careers, relationships, and personal struggles, all while providing each other with unwavering support and plenty of hilarious moments.",
        "buy_link": "https://a.co/d/hUeRaAC",
        "stream_link": "https://www.amazon.com/gp/video/detail/B000N8GL34/ref=atv_dp_share_cu_r"
      },
      {
        "number": 2,
        "image": "img/seasons/season02.jpg",
        "description_text": "In the second season of 'Friends', the lives of Monica, Ross, Chandler, Joey, Rachel, and Phoebe continue to intertwine with humor and heartwarming moments. Monica begins dating Richard, a family friend of the Gellers, which causes tensions within the group due to the significant age difference. Ross, still harboring feelings for Rachel, becomes increasingly jealous of her blossoming relationship with Paolo, an attractive Italian neighbor. Chandler struggles with commitment when Janice, his ex-girlfriend, reenters his life. Joey's acting career gains momentum, and he lands a recurring role in a soap opera. Phoebe discovers her birth mother's identity and navigates a reunion filled with mixed emotions. Throughout the season, the friends face hilarious mishaps, romantic entanglements, and personal growth, strengthening their bonds and providing viewers with a mix of laughter and heartfelt moments.",
        "buy_link": "https://a.co/d/bGDHu8b",
        "stream_link": "https://www.amazon.com/gp/video/detail/B000KZFMZI/ref=atv_dp_share_cu_r"
      },
      {
        "number": 3,
        "image": "img/seasons/season03.jpg",
        "description_text": "In the third season of 'Friends', the group continues to navigate the ups and downs of life in New York City. Ross explores new romantic interests, including a brief fling with Chloe, the 'copy girl' at his office. Monica begins a serious relationship with Pete, a millionaire who pursues his dream of becoming the Ultimate Fighting Champion. Chandler's sarcastic humor takes a backseat when he falls in love with Kathy, Joey's girlfriend, leading to a tumultuous love triangle. Rachel, still harboring feelings for Ross, starts dating a handsome yet possessive man named Joshua. Phoebe learns the truth about her birth mother and struggles with mixed emotions and feelings of abandonment. Throughout the season, the friends support each other through hilarious misadventures, romantic entanglements, and personal growth, reaffirming the enduring strength of their friendship.",
        "buy_link": "https://a.co/d/9N3SsZF",
        "stream_link": "https://www.amazon.com/gp/video/detail/B000KZFN66/ref=atv_dp_share_cu_r"
      },
      {
        "number": 4,
        "image": "img/seasons/season04.jpg",
        "description_text": "In the fourth season of 'Friends', the group faces a myriad of challenges and memorable moments. Ross begins dating Emily, a woman from London, leading to a whirlwind romance that culminates in a dramatic wedding cliffhanger. Chandler's relationship with Kathy comes to an end when she cheats on him with a co-star, pushing him into a spiral of jealousy and heartbreak. Monica starts a catering business and navigates a complicated love triangle between Richard, her ex-boyfriend, and his son, Timothy. Rachel finds herself torn between her attraction to Ross and her budding relationship with Joshua, which ultimately ends in a disastrous Thanksgiving mishap. Joey lands a major acting role in a soap opera but struggles with the demands of fame and his feelings for his co-star, Kate. Phoebe faces the challenge of carrying her brother's triplets as a surrogate, leading to emotional and comedic moments. Throughout the season, the friends support each other through laughter, tears, and unexpected twists, reinforcing the bond that keeps them together through it all.",
        "buy_link": "https://a.co/d/90ZUVpB",
        "stream_link": "https://www.amazon.com/gp/video/detail/B000PB30IS/ref=atv_dp_share_cu_r"
      },
      {
        "number": 5,
        "image": "img/seasons/season05.jpg",
        "description_text": "In the fifth season of 'Friends', the group experiences significant changes and hilarious misadventures. Ross and Emily's marriage ends abruptly when Ross accidentally says Rachel's name during their vows, causing turmoil and leaving Ross torn between two women. Monica and Chandler's secret romance comes to light, shocking their friends and leading to a new level of commitment for the couple. Phoebe discovers that her birth mother is alive and reconnects with her, leading to a heartwarming reunion. Joey embarks on a rollercoaster acting career, finding success as Dr. Drake Ramoray on a soap opera but ultimately losing the role due to a dramatic storyline twist. Rachel starts working at Ralph Lauren, which brings new challenges and a new romantic interest, Tag. Throughout the season, the friends navigate complicated relationships, career changes, and unexpected surprises, highlighting the enduring bond and hilarious dynamic that makes 'Friends' a beloved sitcom.",
        "buy_link": "https://a.co/d/3c7Dt0g",
        "stream_link": "https://www.amazon.com/gp/video/detail/B000PB3DTY/ref=atv_dp_share_cu_r"
      },
      {
        "number": 6,
        "image": "img/seasons/season06.jpg",
        "description_text": "In the sixth season of 'Friends', the group faces various milestones and comedic situations. Ross deals with the aftermath of his impulsive Vegas wedding to Rachel and contemplates the future of their relationship. Monica and Chandler navigate the challenges of planning their wedding, including a mix-up with their chosen venue. Joey lands a leading role in a major film but struggles with the demanding work schedule and the attention of his attractive co-star, Kate. Phoebe embarks on a romantic relationship with a police officer, Gary, leading to a memorable incident involving a police badge. Rachel explores her career ambitions and lands a job at Ralph Lauren, which causes tension with her assistant, Tag, due to their romantic history. Throughout the season, the friends provide unwavering support, hilarious moments, and heartwarming gestures, reinforcing the enduring bonds.",
        "buy_link": "https://a.co/d/fL5v1Pn",
        "stream_link": "https://www.amazon.com/gp/video/detail/B001KWTBR0/ref=atv_dp_share_cu_r"
      },
      {
        "number": 7,
        "image": "img/seasons/season07.jpg",
        "description_text": "In the seventh season of 'Friends', the group faces new challenges and comedic situations. Monica and Chandler navigate the early stages of their marriage and contemplate starting a family. Ross struggles with jealousy when Rachel begins dating her assistant, Tag, while also dealing with the evolving relationship between him and his daughter, Emma. Joey experiences a decline in his acting career but finds success as the host of a game show called 'Bamboozled'. Phoebe finds love with Mike, a quirky musician, and they embark on a heartwarming relationship. Rachel discovers she is pregnant, leading to a series of comical and heartwarming moments as the group rallies around her. Throughout the season, the friends support each other through laughter, tears, and unexpected twists, highlighting the enduring bond and hilarious dynamic that makes 'Friends' a beloved sitcom.",
        "buy_link": "https://a.co/d/eTZeLSm",
        "stream_link": "https://www.amazon.com/gp/video/detail/B002ATN2L8/ref=atv_dp_share_cu_r"
      },
      {
        "number": 8,
        "image": "img/seasons/season08.jpg",
        "description_text": "In the eighth season of 'Friends', the group faces new adventures and significant developments. Monica and Chandler continue to navigate the challenges of married life, while also exploring the possibility of starting a family through adoption. Ross grapples with his feelings for Rachel and deals with the aftermath of a failed marriage proposal to Emily. Joey finds success in his acting career when he lands a leading role in a historical drama, 'Mac and C.H.E.E.S.E.', but faces personal struggles when he falls for his co-star, Kate. Rachel develops a close bond with Joey and contemplates her feelings for him, causing tension and confusion within the group. Phoebe embarks on a romantic relationship with Mike and faces obstacles as they navigate their future together. Throughout the season, the friends provide laughter, support, and poignant moments as they tackle the complexities of love, careers, and personal growth.",
        "buy_link": "https://a.co/d/4C6O22f",
        "stream_link": "https://www.amazon.com/gp/video/detail/B002AS4KEW/ref=atv_dp_share_cu_r"
      },
      {
        "number": 9,
        "image": "img/seasons/season09.jpg",
        "description_text": "In the ninth season of 'Friends', the group faces new challenges and life-altering moments. Monica and Chandler struggle with infertility and explore various options to conceive a child, including adoption and fertility treatments. Ross deals with the aftermath of his impulsive decision to marry Emily and faces the consequences of his actions. Rachel becomes a mother to Emma and navigates the complexities of single parenthood while juggling her career. Joey finds success in his acting career with a leading role in a Broadway show, but faces romantic struggles and heartbreak along the way. Phoebe embarks on a romantic relationship with Mike and contemplates the idea of marriage. Throughout the season, the friends provide unwavering support, humor, and emotional moments, highlighting the enduring bonds that make them the beloved characters of the sitcom.",
        "buy_link": "https://a.co/d/3qYjkEI",
        "stream_link": "https://www.amazon.com/gp/video/detail/B002C65WR6/ref=atv_dp_share_cu_r"
      },
      {
        "number": 10,
        "image": "img/seasons/season10.jpg",
        "description_text": "In the final season of 'Friends', the group faces major life changes and emotional farewells. Monica and Chandler prepare to adopt a child, leading to a heartwarming journey and ultimate fulfillment of their dreams of becoming parents. Ross and Rachel navigate their complicated relationship once again, finally realizing their deep love for each other. Joey finds success in his acting career with a leading role in a new TV series but grapples with leaving his friends behind. Phoebe gets married to Mike in a sweet and unconventional ceremony, embracing her happy ending. Throughout the season, the friends come to terms with the imminent end of their era and reflect on their individual growth and shared memories. The final episode brings closure as the group says their emotional goodbyes, leaving viewers with a lasting sense of nostalgia and the knowledge that the bonds forged between these friends will endure even after the series ends.",
        "buy_link": "https://a.co/d/hCsAdBC",
        "stream_link": "https://www.amazon.com/gp/video/detail/B002C4Y3DC/ref=atv_dp_share_cu_r"
      }
    ]
  }
  